# Importar la bibliteca de Pandas

In [1]:
import pandas as pd

Nombro una funcion "tabla" y le digo q lea data frame en la ruta

In [2]:
tabla = pd.read_csv(r'C:\Users\alabama\Documents\Programacion\Jupyter_Folders\TablaEjemplo.csv')

asi se ve al llamar la funcion

In [3]:
tabla

  Nombre  Edad       País Automovil
0   Juan    35     México        No
1  Pedro    41     España        Si
2  María    28       Perú        Si
3  Laura    66  Argentina        No

asi puedo llamar a una serie del data frame

In [4]:
tabla["Nombre"]

0     Juan
1    Pedro
2    María
3    Laura
Name: Nombre, dtype: object

otra forma de hacerlo pero asi no funciona si en la serie existen espacios

In [5]:
tabla.Edad

0    35
1    41
2    28
3    66
Name: Edad, dtype: int64

asi puedo llamar mas de una serie

In [6]:
tabla[["Nombre","País"]]

  Nombre       País
0   Juan     México
1  Pedro     España
2  María       Perú
3  Laura  Argentina

aqui me dice el tipo de objeto es el q estoy usando, con el parametro TYPE, en este caso es una serie

In [7]:
type(tabla.Nombre)

pandas.core.series.Series

En este caso es un data frame al pasar dos series juntas

In [8]:
type(tabla[["Nombre","País"]])

pandas.core.frame.DataFrame

In [10]:
tabla2 = pd.read_csv("C:/Users/alabama/Documents/Programacion/Jupyter_Folders/ventasTotales.csv" , skiprows=5 , sep= ';')